{"word2id": {"yes": 0, "no": 1, "before": 2, "after": 3, "bed": 4, "chair": 5, "dish": 6, "food": 7, "clothes": 8, "blanket": 9, "table": 10, "paper": 11, "floor": 12, "doorway": 13, "closet": 14, "shoe": 15, "bag": 16, "door": 17, "pillow": 18, "laptop": 19, "phone": 20, "box": 21, "doorknob": 22, "mirror": 23, "refrigerator": 24, "television": 25, "window": 26, "broom": 27, "medicine": 28, "picture": 29, "light": 30, "vacuum": 31, "holding some food": 32, "holding a cup of something": 33, "holding a blanket": 34, "sitting in a chair": 35, "smiling at something": 36, "standing up": 37, "holding a dish": 38, "holding a phone": 39, "holding some clothes": 40, "sitting in a bed": 41, "eating some food": 42, "walking through a doorway": 43, "holding a bag": 44, "making some food": 45, "holding a book": 46, "lying on a bed": 47, "laughing at something": 48, "holding a broom": 49, "holding a pillow": 50, "watching something in a mirror": 51, "dressing themselves": 52, "tidying up a table": 53, "watching a laptop or something on a laptop": 54, "tidying something on the floor": 55, "sitting at a table": 56, "drinking from a cup": 57, "sitting on the floor": 58, "watching television": 59, "watching a book": 60, "playing with a phone": 61, "holding a paper": 62, "undressing themselves": 63, "snuggling with a blanket": 64, "going from standing to sitting": 65, "watching outside of a window": 66, "holding a box": 67, "sneezing somewhere": 68, "grasping onto a doorknob": 69, "opening a closet": 70, "holding some medicine": 71, "washing something with a blanket": 72, "holding a vacuum": 73, "holding a laptop": 74, "holding a shoe": 75, "putting a phone somewhere": 76, "putting some food somewhere": 77, "pouring something into a cup": 78, "opening a door": 79, "tidying up a closet": 80, "putting a blanket somewhere": 81, "awakening in bed": 82, "closing a door": 83, "putting clothes somewhere": 84, "lying on the floor": 85, "putting on a shoe": 86, "opening a refrigerator": 87, "closing a closet": 88, "turning off a light": 89, "watching a picture": 90, "putting something on a table": 91, "taking a blanket from somewhere": 92, "snuggling with a pillow": 93, "taking some clothes from somewhere": 94, "talking on a phone": 95, "working at a table": 96, "closing a refrigerator": 97, "tidying some clothes": 98, "working on a book": 99, "running somewhere": 100, "taking off some shoes": 101, "putting a bag somewhere": 102, "tidying up a blanket": 103, "holding a picture": 104, "putting a cup somewhere": 105, "taking a bag from somewhere": 106, "fixing their hair": 107, "putting a dish somewhere": 108, "turning on a light": 109, "washing some clothes": 110, "putting a broom somewhere": 111, "consuming some medicine": 112, "taking food from somewhere": 113, "taking a picture of something": 114, "throwing clothes somewhere": 115, "washing their hands": 116, "washing a dish": 117, "holding a mirror": 118, "throwing a blanket somewhere": 119, "throwing a pillow somewhere": 120, "taking a broom from somewhere": 121, "opening a bag": 122, "closing a window": 123, "washing a window": 124, "putting a pillow somewhere": 125, "opening a window": 126, "standing on a chair": 127, "fixing a vacuum": 128, "sitting on a table": 129, "smiling in a mirror": 130, "closing a box": 131, "fixing a light": 132, "washing a cup": 133, "taking a cup from somewhere": 134, "smiling at a book": 135, "taking shoes from somewhere": 136, "putting a box somewhere": 137, "opening a box": 138, "washing a table": 139, "taking a phone from somewhere": 140, "taking a vacuum from somewhere": 141, "taking a dish from somewhere": 142, "fixing a doorknob": 143, "throwing a bag somewhere": 144, "closing a laptop": 145, "washing a mirror": 146, "taking a box from somewhere": 147, "throwing something on the floor": 148, "fixing a door": 149, "taking a pillow from somewhere": 150, "opening a laptop": 151, "throwing a broom somewhere": 152, "putting shoes somewhere": 153, "laughing at a television": 154, "taking something from a box": 155, "throwing food somewhere": 156, "opening a book": 157, "closing a book": 158, "putting their paper somewhere": 159, "throwing a book somewhere": 160, "laughing at a picture": 161, "taking paper from somewhere": 162, "putting a book somewhere": 163, "throwing shoes somewhere": 164, "reaching for and grabbing a picture": 165, "taking a book from somewhere": 166, "tidying up with a broom": 167, "putting a laptop somewhere": 168, "throwing a box somewhere": 169, "taking a laptop from somewhere": 170, "<UNK>": 171}, "id2word": {"0": "yes", "1": "no", "2": "before", "3": "after", "4": "bed", "5": "chair", "6": "dish", "7": "food", "8": "clothes", "9": "blanket", "10": "table", "11": "paper", "12": "floor", "13": "doorway", "14": "closet", "15": "shoe", "16": "bag", "17": "door", "18": "pillow", "19": "laptop", "20": "phone", "21": "box", "22": "doorknob", "23": "mirror", "24": "refrigerator", "25": "television", "26": "window", "27": "broom", "28": "medicine", "29": "picture", "30": "light", "31": "vacuum", "32": "holding some food", "33": "holding a cup of something", "34": "holding a blanket", "35": "sitting in a chair", "36": "smiling at something", "37": "standing up", "38": "holding a dish", "39": "holding a phone", "40": "holding some clothes", "41": "sitting in a bed", "42": "eating some food", "43": "walking through a doorway", "44": "holding a bag", "45": "making some food", "46": "holding a book", "47": "lying on a bed", "48": "laughing at something", "49": "holding a broom", "50": "holding a pillow", "51": "watching something in a mirror", "52": "dressing themselves", "53": "tidying up a table", "54": "watching a laptop or something on a laptop", "55": "tidying something on the floor", "56": "sitting at a table", "57": "drinking from a cup", "58": "sitting on the floor", "59": "watching television", "60": "watching a book", "61": "playing with a phone", "62": "holding a paper", "63": "undressing themselves", "64": "snuggling with a blanket", "65": "going from standing to sitting", "66": "watching outside of a window", "67": "holding a box", "68": "sneezing somewhere", "69": "grasping onto a doorknob", "70": "opening a closet", "71": "holding some medicine", "72": "washing something with a blanket", "73": "holding a vacuum", "74": "holding a laptop", "75": "holding a shoe", "76": "putting a phone somewhere", "77": "putting some food somewhere", "78": "pouring something into a cup", "79": "opening a door", "80": "tidying up a closet", "81": "putting a blanket somewhere", "82": "awakening in bed", "83": "closing a door", "84": "putting clothes somewhere", "85": "lying on the floor", "86": "putting on a shoe", "87": "opening a refrigerator", "88": "closing a closet", "89": "turning off a light", "90": "watching a picture", "91": "putting something on a table", "92": "taking a blanket from somewhere", "93": "snuggling with a pillow", "94": "taking some clothes from somewhere", "95": "talking on a phone", "96": "working at a table", "97": "closing a refrigerator", "98": "tidying some clothes", "99": "working on a book", "100": "running somewhere", "101": "taking off some shoes", "102": "putting a bag somewhere", "103": "tidying up a blanket", "104": "holding a picture", "105": "putting a cup somewhere", "106": "taking a bag from somewhere", "107": "fixing their hair", "108": "putting a dish somewhere", "109": "turning on a light", "110": "washing some clothes", "111": "putting a broom somewhere", "112": "consuming some medicine", "113": "taking food from somewhere", "114": "taking a picture of something", "115": "throwing clothes somewhere", "116": "washing their hands", "117": "washing a dish", "118": "holding a mirror", "119": "throwing a blanket somewhere", "120": "throwing a pillow somewhere", "121": "taking a broom from somewhere", "122": "opening a bag", "123": "closing a window", "124": "washing a window", "125": "putting a pillow somewhere", "126": "opening a window", "127": "standing on a chair", "128": "fixing a vacuum", "129": "sitting on a table", "130": "smiling in a mirror", "131": "closing a box", "132": "fixing a light", "133": "washing a cup", "134": "taking a cup from somewhere", "135": "smiling at a book", "136": "taking shoes from somewhere", "137": "putting a box somewhere", "138": "opening a box", "139": "washing a table", "140": "taking a phone from somewhere", "141": "taking a vacuum from somewhere", "142": "taking a dish from somewhere", "143": "fixing a doorknob", "144": "throwing a bag somewhere", "145": "closing a laptop", "146": "washing a mirror", "147": "taking a box from somewhere", "148": "throwing something on the floor", "149": "fixing a door", "150": "taking a pillow from somewhere", "151": "opening a laptop", "152": "throwing a broom somewhere", "153": "putting shoes somewhere", "154": "laughing at a television", "155": "taking something from a box", "156": "throwing food somewhere", "157": "opening a book", "158": "closing a book", "159": "putting their paper somewhere", "160": "throwing a book somewhere", "161": "laughing at a picture", "162": "taking paper from somewhere", "163": "putting a book somewhere", "164": "throwing shoes somewhere", "165": "reaching for and grabbing a picture", "166": "taking a book from somewhere", "167": "tidying up with a broom", "168": "putting a laptop somewhere", "169": "throwing a box somewhere", "170": "taking a laptop from somewhere", "171": "<UNK>"}}